; domain
(define (domain lec-winter-split)
    (:requirements :strips :typing :equality :negative-preconditions)
    
    (:types 
        match team referee server slot - object
    )
    
    (:constants 
        home away - slot 
    )

    (:predicates
        ;; Topología del torneo
        (connected ?m1 - match ?m2 - match ?s - slot)
        (participant ?t - team ?m - match ?s - slot)
        
        ;; Estado del Partido
        (scheduled ?m - match)          ;; Partido en lobby/champ select
        (played ?m - match)             ;; La partida terminó (nexus explota)
        (result-reported ?m - match)    ;; El arbitro firmó el acta
        (verified ?m - match)           ;; La liga validó el resultado final
        (winner-determined ?m - match)  ;; Hay un ganador oficial
        (winner ?m - match ?t - team)
        
        ;; Gestión de Conflictos e Incidencias
        (has-conflict ?m - match)       ;; PREDICADO ESTÁTICO: Indica que este match "está gafado" y fallará
        (protest-active ?m - match)     ;; Hay una pausa/protesta en curso
        (protest-handled ?m - match)    ;; La protesta se resolvió (se mantiene el resultado)
        
        ;; Recursos
        (ref-available ?r - referee)
        (server-available ?s - server)
        (referee-assigned ?r - referee ?m - match)
    )

    ;; --- FASE 1: PREPARACIÓN ---

    (:action start-champ-select
        :parameters (?m - match ?s - server ?t1 - team ?t2 - team)
        :precondition (and 
            (participant ?t1 ?m home)
            (participant ?t2 ?m away)
            (not (scheduled ?m))
            (not (winner-determined ?m))
            (server-available ?s)
        )
        :effect (and 
            (scheduled ?m)
            (not (server-available ?s)) ;; Ocupamos servidor
        )
    )

    ;; --- FASE 2: EJECUCIÓN (JUGAR) ---

    ;; Opción A: Partida Limpia (Solo si NO hay conflicto predefinido)
    (:action play-clean-game
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (not (has-conflict ?m)) ;; Condición clave: Solo si no está "gafado"
        )
        :effect (and 
            (played ?m)
            (server-available ?s)      ;; Liberamos server al acabar
            (not (ref-available ?r))   ;; Ocupamos árbitro para el acta
            (referee-assigned ?r ?m)
        )
    )

    ;; Opción B: Partida con Bug (Obligatoria si hay conflicto predefinido)
    (:action play-with-technical-issue
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (has-conflict ?m)       ;; Condición clave: El planificador DEBE elegir esta
        )
        :effect (and 
            (played ?m)
            (protest-active ?m)     ;; Se activa la incidencia
            (server-available ?s)   ;; Liberamos server
            (not (ref-available ?r))
            (referee-assigned ?r ?m)
        )
    )

    ;; --- FASE 3: RESOLUCIÓN DE INCIDENCIAS ---

    ;; Resolución 1: Ruling Confirm (El bug no afecta, seguimos)
    (:action adjudicate-ruling-confirm
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (protest-handled ?m)
        )
    )

    ;; Resolución 2: Chronobreak/Replay (Borramos lo jugado)
    (:action adjudicate-chronobreak-replay
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (not (played ?m))           ;; OJO: Reseteamos estado
            (not (has-conflict ?m))     ;; ASUNCIÓN: El replay arregla el bug (evita bucles infinitos)
            (not (referee-assigned ?r ?m))
            (ref-available ?r)          ;; Liberamos al árbitro para que vuelva a empezar
            ;; El partido sigue (scheduled ?m), así que se puede volver a jugar
        )
    )

    ;; --- FASE 4: ACTA Y VERIFICACIÓN ---

    ;; El árbitro firma el acta
    (:action sign-match-sheet
        :parameters (?m - match ?t - team ?r - referee)
        :precondition (and 
            (played ?m)
            (participant ?t ?m home) ;; Simplificación: Asumimos que gana HOME (para que el planner elija)
            (not (result-reported ?m))
            (not (protest-active ?m))
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (result-reported ?m)
            (winner ?m ?t)
            (not (referee-assigned ?r ?m))
            (ref-available ?r) ;; Liberamos al árbitro
        )
    )

    ;; La liga verifica el resultado (Burocracia final)
    (:action verify-result
        :parameters (?m - match)
        :precondition (and 
            (result-reported ?m)
            (not (verified ?m))
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
        )
    )

    ;; --- OPCIÓN ESPECIAL: NO-SHOW (Sanción) ---
    (:action declare-noshow
        :parameters (?m - match ?t - team)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (participant ?t ?m home) ;; O away, el planner decide quién gana por incomparecencia
        )
        :effect (and 
            (played ?m)
            (result-reported ?m)
            (winner ?m ?t)
            (verified ?m)
            (winner-determined ?m)
            ;; Si usamos esta acción, asumimos que liberamos recursos implícitamente
        )
    )

    ;; --- FASE 5: AVANCE DE BRACKET ---

    (:action promote-to-next-round
        :parameters (?m_src - match ?m_dst - match ?t - team ?s - slot)
        :precondition (and 
            (winner-determined ?m_src)
            (winner ?m_src ?t)
            (connected ?m_src ?m_dst ?s)
        )
        :effect (and 
            (participant ?t ?m_dst ?s)
        )
    )
)

; problem
(define (problem lec-8-R4-S4-P40)
    (:domain lec-winter-split)
    (:objects
        team-1 team-2 team-3 team-4 team-5 team-6 team-7 team-8 - team
        m1 m2 m3 m4 m5 m6 m7 - match
        ref-1 ref-2 ref-3 ref-4 - referee
        server-1 server-2 server-3 server-4 - server
    )
    (:init
        (ref-available ref-1)
        (ref-available ref-2)
        (ref-available ref-3)
        (ref-available ref-4)
        (server-available server-1)
        (server-available server-2)
        (server-available server-3)
        (server-available server-4)
        (participant team-1 m1 home)
        (participant team-2 m1 away)
        (participant team-3 m2 home)
        (participant team-4 m2 away)
        (participant team-5 m3 home)
        (participant team-6 m3 away)
        (participant team-7 m4 home)
        (participant team-8 m4 away)
        (connected m1 m5 home)
        (connected m2 m5 away)
        (connected m3 m6 home)
        (connected m4 m6 away)
        (connected m5 m7 home)
        (connected m6 m7 away)
        (has-conflict m1)
    )
    (:goal
        (verified m7)
    )
)

; plan
1. (start-champ-select m1 server-1 team-1 team-2)
   deleted: (server-available server-1)
   added: (scheduled m1)
   goals met: 0 of 1
2. (start-champ-select m2 server-2 team-3 team-4)
   deleted: (server-available server-2)
   added: (scheduled m2)
   goals met: 0 of 1
3. (start-champ-select m3 server-3 team-5 team-6)
   deleted: (server-available server-3)
   added: (scheduled m3)
   goals met: 0 of 1
4. (declare-noshow m1 team-1)
   added: (played m1) (result-reported m1) (winner m1 team-1) (verified m1) (winner-determined m1)
   goals met: 0 of 1
5. (promote-to-next-round m1 m5 team-1 home)
   added: (participant team-1 m5 home)
   goals met: 0 of 1
6. (declare-noshow m2 team-3)
   added: (played m2) (result-reported m2) (winner m2 team-3) (verified m2) (winner-determined m2)
   goals met: 0 of 1
7. (promote-to-next-round m2 m5 team-3 away)
   added: (participant team-3 m5 away)
   goals met: 0 of 1
8. (declare-noshow m3 team-5)
   added: (played m3) (result-reported m3) (winner m3 team-5) (verified m3) (winner-determined m3)
   goals met: 0 of 1
9. (promote-to-next-round m3 m6 team-5 home)
   added: (participant team-5 m6 home)
   goals met: 0 of 1
10. (start-champ-select m5 server-4 team-1 team-3)
   deleted: (server-available server-4)
   added: (scheduled m5)
   goals met: 0 of 1
11. (play-clean-game m5 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m5) (server-available server-1) (referee-assigned ref-1 m5)
   goals met: 0 of 1
12. (sign-match-sheet m5 team-1 ref-1)
   deleted: (referee-assigned ref-1 m5)
   added: (result-reported m5) (winner m5 team-1) (ref-available ref-1)
   goals met: 0 of 1
13. (verify-result m5)
   added: (verified m5) (winner-determined m5)
   goals met: 0 of 1
14. (promote-to-next-round m5 m7 team-1 home)
   added: (participant team-1 m7 home)
   goals met: 0 of 1
15. (start-champ-select m4 server-1 team-7 team-8)
   deleted: (server-available server-1)
   added: (scheduled m4)
   goals met: 0 of 1
16. (play-clean-game m4 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m4) (server-available server-1) (referee-assigned ref-1 m4)
   goals met: 0 of 1
17. (sign-match-sheet m4 team-7 ref-1)
   deleted: (referee-assigned ref-1 m4)
   added: (result-reported m4) (winner m4 team-7) (ref-available ref-1)
   goals met: 0 of 1
18. (verify-result m4)
   added: (verified m4) (winner-determined m4)
   goals met: 0 of 1
19. (promote-to-next-round m4 m6 team-7 away)
   added: (participant team-7 m6 away)
   goals met: 0 of 1
20. (start-champ-select m6 server-1 team-5 team-7)
   deleted: (server-available server-1)
   added: (scheduled m6)
   goals met: 0 of 1
21. (play-clean-game m6 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m6) (server-available server-1) (referee-assigned ref-1 m6)
   goals met: 0 of 1
22. (sign-match-sheet m6 team-5 ref-1)
   deleted: (referee-assigned ref-1 m6)
   added: (result-reported m6) (winner m6 team-5) (ref-available ref-1)
   goals met: 0 of 1
23. (verify-result m6)
   added: (verified m6) (winner-determined m6)
   goals met: 0 of 1
24. (promote-to-next-round m6 m7 team-5 away)
   added: (participant team-5 m7 away)
   goals met: 0 of 1
25. (start-champ-select m7 server-1 team-1 team-5)
   deleted: (server-available server-1)
   added: (scheduled m7)
   goals met: 0 of 1
26. (declare-noshow m7 team-1)
   added: (played m7) (result-reported m7) (winner m7 team-1) (verified m7) (winner-determined m7)
   goals met: 1 of 1
